problems/+azevedo/@ImpactOnBrick/meshes/brick4x4x4/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-3;

vertices
(
    (-64.845 0     -61) 
    ( 64.845 0     -61)
    ( 64.845 34.23 -61)
    (-64.845 34.23 -61)
    (-64.845 0      61)
    ( 64.845 0      61)
    ( 64.845 34.23  61)
    (-64.845 34.23  61)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (4 4 4) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    top
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }

    left
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }
    
    right
    {
        type wall;
        faces
        (
            (2 6 5 1)
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }

    back 
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }

    front
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
